| Tipo | ¿Para qué se usa? | Comentarios útiles |
|---|---|---|
| **Enteros exactos** |||
| TINYINT | Enteros muy pequeños (flags, booleanos) | -128 a 127 o 0–255 sin signo |
| SMALLINT | Enteros pequeños | -32,768 a 32,767 |
| MEDIUMINT | Enteros medianos | -8M a 8M aprox. |
| INT / INTEGER | Enteros comunes | ±2,147,483,648 |
| BIGINT | Enteros grandes (IDs, contadores) | ±9e18 |
| BIT(M) | Bits compactos | M entre 1 y 64 |
| BOOL / BOOLEAN | Valores booleanos | Es alias de TINYINT(1) |
| **Números exactos** |||
| DECIMAL(M,D) | Importes monetarios | Precisión exacta |
| NUMERIC(M,D) | Igual que DECIMAL | Sin error de flotación |
| **Flotantes** |||
| FLOAT | Decimales aproximados | Precisión simple |
| DOUBLE | Decimales aproximados | Precisión doble |
| **Fecha y hora** |||
| DATE | Solo fecha | Formato YYYY-MM-DD |
| TIME | Solo hora | HH:MM:SS |
| DATETIME | Fecha y hora | No depende zona |
| TIMESTAMP | Fecha y hora con zona UTC interna | Puede auto-actualizarse |
| YEAR | Año | 1901–2155 |
| **Cadenas** |||
| CHAR(N) | Texto fijo | 0–255 chars |
| VARCHAR(N) | Texto variable | Hasta 65 KB |
| TINYTEXT | Texto corto | 255 bytes |
| TEXT | Texto medio | 65 KB |
| MEDIUMTEXT | Texto grande | 16 MB |
| LONGTEXT | Texto muy grande | 4 GB |
| ENUM(...) | Valor único de lista | Guarda índice |
| SET(...) | Conjunto de valores | Permite varios |
| JSON | Datos JSON válidos | Funciones JSON |
| **Binarios** |||
| BINARY(N) | Binario fijo | 0–255 bytes |
| VARBINARY(N) | Binario variable | Tamaño dependiente fila |
| TINYBLOB | Binario corto | 255 bytes |
| BLOB | Binario medio | 65 KB |
| MEDIUMBLOB | Binario grande | 16 MB |
| LONGBLOB | Binario muy grande | 4 GB |
| **Geoespaciales (GIS)** |||
| GEOMETRY | Tipo geométrico genérico | — |
| POINT | Punto | (x, y) |
| LINESTRING | Línea | Secuencia de puntos |
| POLYGON | Polígono | — |
| MULTIPOINT | Varios puntos | — |
| MULTILINESTRING | Varias líneas | — |
| MULTIPOLYGON | Varios polígonos | — |
| GEOMETRYCOLLECTION | Colección de geometrías | — |
| **Atributos / extras** |||
| SERIAL | Atajo de BIGINT UNSIGNED AUTO_INCREMENT | Conveniente |
| UNSIGNED | Solo valores positivos | Duplica rango positivo |
| ZEROFILL | Relleno con ceros | Implica UNSIGNED |
| AUTO_INCREMENT | Incremento automático | Solo una por tabla |

In [1]:
%load_ext sql

In [2]:
%sql sqlite:///Data_types.db

#### **DATES & TIME** ####

In [3]:
%%sql
CREATE TABLE people ( name VARCHAR(50), bird_date DATE );

 * sqlite:///Data_types.db
(sqlite3.OperationalError) table people already exists
[SQL: CREATE TABLE people ( name VARCHAR(50), bird_date DATE );]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [4]:
%sql SELECT * FROM people

 * sqlite:///Data_types.db
Done.

[('sapt', '2000-01-30'), ('sapt', '2000-01-30')]

In [5]:
%sql INSERT INTO people (name, bird_date) VALUES ('sapt', '2000-01-30');

 * sqlite:///Data_types.db
1 rows affected.

[]

In [6]:
%sql SELECT * FROM people;

 * sqlite:///Data_types.db
Done.

[('sapt', '2000-01-30'), ('sapt', '2000-01-30'), ('sapt', '2000-01-30')]

In [7]:
%%sql
CREATE TABLE peoplesx (
	name VARCHAR(100),
    birthdate DATE,
    birthtime TIME,
    birthdt DATETIME
);
 
INSERT INTO peoples (name, birthdate, birthtime, birthdt)
VALUES ('Elton', '2000-12-25', '11:00:00', '2000-12-25 11:00:00');
 
INSERT INTO peoples (name, birthdate, birthtime, birthdt)
VALUES ('Lulu', '1985-04-11', '9:45:10', '1985-04-11 9:45:10');
 
INSERT INTO peoples (name, birthdate, birthtime, birthdt)
VALUES ('Juan', '2020-08-15', '23:59:00', '2020-08-15 23:59:00');

 * sqlite:///Data_types.db
(sqlite3.OperationalError) table peoplesx already exists
[SQL: CREATE TABLE peoplesx (
	name VARCHAR(100),
    birthdate DATE,
    birthtime TIME,
    birthdt DATETIME
);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [8]:
%sql PRAGMA table_info(peoplesx);

 * sqlite:///Data_types.db
Done.

[(0, 'name', 'VARCHAR(100)', 0, None, 0),
 (1, 'birthdate', 'DATE', 0, None, 0),
 (2, 'birthtime', 'TIME', 0, None, 0),
 (3, 'birthdt', 'DATETIME', 0, None, 0)]

In [9]:
%sql DROP TABLE peoples;

 * sqlite:///Data_types.db
(sqlite3.OperationalError) no such table: peoples
[SQL: DROP TABLE peoples;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [10]:
%%sql
Select name
FROM sqlite_master
WHERE type='table';

 * sqlite:///Data_types.db
Done.

[('people',), ('peoplesx',)]

#### **CURDATE() CURTIME() NOW()** ####

In [11]:
%sql SELECT CURDATE();

 * sqlite:///Data_types.db
(sqlite3.OperationalError) no such function: CURDATE
[SQL: SELECT CURDATE();]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [12]:
%sql SELECT current_date;

 * sqlite:///Data_types.db
Done.

[('2026-02-03',)]

In [13]:
%sql SELECT TIME('now')

 * sqlite:///Data_types.db
Done.

[('15:47:09',)]

In [16]:
%%sql
SELECT CURDATE();
SELECT CURTIME();
SELECT NOW();

 * sqlite:///Data_types.db
(sqlite3.OperationalError) no such function: CURDATE
[SQL: SELECT CURDATE();]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [18]:
%%sql
INSERT INTO peoplesx (name, birthdate, birthtime, birthdt)
VALUES ('Ana', current_date, time(), time('now'));

 * sqlite:///Data_types.db
1 rows affected.

[]

In [21]:
%sql SELECT * FROM peoplesx;

 * sqlite:///Data_types.db
Done.

[('Ana', '2026-02-03', '15:52:28', '15:52:28')]

#### **DATE Functions** ####

In [23]:
%%sql
SELECT 
    birthdate,
    DAY(birthdate),
    DAYOFWEEK(birthdate),
    DAYOFYEAR(birthdate)
FROM peoplesx;

 * sqlite:///Data_types.db
(sqlite3.OperationalError) no such function: DAY
[SQL: SELECT
    birthdate,
    DAY(birthdate),
    DAYOFWEEK(birthdate),
    DAYOFYEAR(birthdate)
FROM peoplesx;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [25]:
%%sql
SELECT 
    birthdate,
    MONTHNAME(birthdate),
    YEAR(birthdate)
FROM peoplesx;

 * sqlite:///Data_types.db
(sqlite3.OperationalError) no such function: MONTHNAME
[SQL: SELECT
    birthdate,
    MONTHNAME(birthdate),
    YEAR(birthdate)
FROM peoplesx;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)


| Formato | Significado                           |
|---------|----------------------------------------|
| `%d`    | Día del mes (01–31)                    |
| `%w`    | Día de la semana (0 = domingo, 6 = sábado) |
| `%j`    | Día del año (001–366)                  |

In [24]:
%%sql
SELECT
    birthdate,
    CAST(strftime('%d', birthdate) AS INT)  AS day,
    CAST(strftime('%w', birthdate) AS INT)  AS day_of_week,  -- 0 = domingo
    CAST(strftime('%j', birthdate) AS INT)  AS day_of_year
FROM peoplesx;

 * sqlite:///Data_types.db
Done.

[('2026-02-03', 3, 2, 34)]

In [26]:
%%sql
SELECT
    birthdate,
    CASE strftime('%m', birthdate)
        WHEN '01' THEN 'January'
        WHEN '02' THEN 'February'
        WHEN '03' THEN 'March'
        WHEN '04' THEN 'April'
        WHEN '05' THEN 'May'
        WHEN '06' THEN 'June'
        WHEN '07' THEN 'July'
        WHEN '08' THEN 'August'
        WHEN '09' THEN 'September'
        WHEN '10' THEN 'October'
        WHEN '11' THEN 'November'
        WHEN '12' THEN 'December'
    END AS month_name,
    CAST(strftime('%Y', birthdate) AS INT) AS year
FROM peoplesx;

 * sqlite:///Data_types.db
Done.

[('2026-02-03', 'February', 2026)]

#### **TIME FUNCTIONS** ####

In [29]:
%%sql
SELECT
    birthtime,
    HOUR(birthtime),
    MINUTE(birthtime)
FROM peoplesx;

 * sqlite:///Data_types.db
(sqlite3.OperationalError) no such function: HOUR
[SQL: SELECT
    birthtime,
    HOUR(birthtime),
    MINUTE(birthtime)
FROM peoplesx;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [31]:
%%sql
SELECT
    birthtime,
    CAST(strftime('%H', birthtime) AS INT) AS hour,
    CAST(strftime('%M', birthtime) AS INT) AS minute
FROM peoplesx;

 * sqlite:///Data_types.db
Done.

[('15:52:28', 15, 52)]

In [30]:
%%sql
SELECT 
    birthdt,
    MONTH(birthdt),
    DAY(birthdt),
    HOUR(birthdt),
    MINUTE(birthdt)
FROM peoplesx;

 * sqlite:///Data_types.db
(sqlite3.OperationalError) no such function: MONTH
[SQL: SELECT
    birthdt,
    MONTH(birthdt),
    DAY(birthdt),
    HOUR(birthdt),
    MINUTE(birthdt)
FROM peoplesx;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [32]:
%%sql
SELECT 
    birthdt,
    CAST(strftime('%m', birthdt) AS INT) AS month,
    CAST(strftime('%d', birthdt) AS INT) AS day,
    CAST(strftime('%H', birthdt) AS INT) AS hour,
    CAST(strftime('%M', birthdt) AS INT) AS minute
FROM peoplesx;

 * sqlite:///Data_types.db
Done.

[('15:52:28', 1, 1, 15, 52)]

#### **FORMATING DATE AND TIMES** ####

In [41]:
%%sql
SELECT
    (
        CASE strftime('%m', birthdate)
            WHEN '01' THEN 'January'
            WHEN '02' THEN 'February'
            WHEN '03' THEN 'March'
            WHEN '04' THEN 'April'
            WHEN '05' THEN 'May'
            WHEN '06' THEN 'June'
            WHEN '07' THEN 'July'
            WHEN '08' THEN 'August'
            WHEN '09' THEN 'September'
            WHEN '10' THEN 'October'
            WHEN '11' THEN 'November'
            WHEN '12' THEN 'December'
        END
        || ' ' ||
        CAST(strftime('%d', birthdate) AS INT)
        || ' ' ||
        CAST(strftime('%Y', birthdate) AS INT)
    ) AS full_date
FROM peoplesx;

 * sqlite:///Data_types.db
Done.

[('February 3 2026',)]

| Formato | Para qué se usa | Ejemplo |
|---------|------------------|---------|
| %Y | Año en 4 dígitos | 2024 |
| %y | Año en 2 dígitos | 24 |
| %m | Mes en número (01–12) | 03 |
| %c | Mes en número sin cero | 3 |
| %M | Nombre completo del mes | March |
| %b | Nombre corto del mes | Mar |
| %d | Día del mes (01–31) | 15 |
| %e | Día del mes sin cero | 15 |
| %W | Nombre completo del día de la semana | Friday |
| %a | Nombre corto del día | Fri |
| %w | Día de la semana (0=domingo) | 5 |
| %j | Día del año (001–366) | 075 |
| %H | Hora 00–23 | 14 |
| %h | Hora 01–12 | 02 |
| %I | Hora 01–12 (igual que %h) | 02 |
| %l | Hora 1–12 sin cero | 2 |
| %i | Minutos (00–59) | 25 |
| %S | Segundos (00–59) | 36 |
| %s | Segundos (igual que %S) | 36 |
| %p | AM/PM | PM |
| %T | Hora en formato 24h (HH:MM:SS) | 14:25:36 |
| %r | Hora en formato 12h (hh:mm:ss AM/PM) | 02:25:36 PM |
| %k | Hora 0–23 sin cero | 14 |
| %U | Semana del año (domingo inicio) | 11 |
| %u | Semana del año (lunes inicio) | 11 |
| %D | Día del mes con sufijo | 15th |
| %f | Microsegundos | 000000 |
| %% | Carácter `%` literal | % |

```sql
SELECT birthdate, DATE_FORMAT(birthdate, '%a %b %D') 
FROM people;

SELECT birthdt, DATE_FORMAT(birthdt, '%H:%i') 
FROM people;

SELECT birthdt, DATE_FORMAT(birthdt, 'BORN ON: %r') 
FROM people;

#### **MATH FUNCTIONS** ####

| Función SQL | Para qué se usa | Ejemplo de uso / Resultado |
|-------------|------------------|-----------------------------|
| NOW() | Fecha y hora actuales del servidor | 2026-02-03 10:32:15 |
| CURDATE() | Solo la fecha actual | 2026-02-03 |
| CURTIME() | Solo la hora actual | 10:32:15 |
| DATE() | Extrae solo la fecha de un datetime | DATE('2026-02-03 10:32:15') → 2026-02-03 |
| TIME() | Extrae la hora de un datetime | TIME('2026-02-03 10:32:15') → 10:32:15 |
| YEAR() | Obtiene el año | YEAR('2026-02-03') → 2026 |
| MONTH() | Obtiene el mes (1–12) | MONTH('2026-02-03') → 2 |
| DAY() | Obtiene el día del mes | DAY('2026-02-03') → 3 |
| HOUR() | Obtiene la hora | HOUR('10:32:15') → 10 |
| MINUTE() | Obtiene los minutos | MINUTE('10:32:15') → 32 |
| SECOND() | Obtiene los segundos | SECOND('10:32:15') → 15 |
| MONTHNAME() | Nombre del mes | MONTHNAME('2026-02-03') → February |
| DAYNAME() | Nombre del día | DAYNAME('2026-02-03') → Tuesday |
| DAYOFWEEK() | Día de la semana (1=domingo) | DAYOFWEEK('2026-02-03') → 3 |
| DAYOFYEAR() | Día del año (1–366) | DAYOFYEAR('2026-02-03') → 34 |
| WEEK() | Semana del año | WEEK('2026-02-03') → 5 |
| DATE_ADD() | Suma intervalos a una fecha | DATE_ADD('2026-02-03', INTERVAL 5 DAY) → 2026-02-08 |
| DATE_SUB() | Resta intervalos a una fecha | DATE_SUB('2026-02-03', INTERVAL 1 MONTH) → 2026-01-03 |
| DATEDIFF() | Diferencia en días entre fechas | DATEDIFF('2026-02-03','2026-02-01') → 2 |
| TIMEDIFF() | Diferencia entre horas | TIMEDIFF('10:32:15','08:00:00') → 02:32:15 |
| DATE_FORMAT() | Formatea la fecha según un patrón | DATE_FORMAT('2026-02-03', '%b %d') → Feb 03 |
| STR_TO_DATE() | Convierte texto a fecha | STR_TO_DATE('03-02-2026','%d-%m-%Y') |

#### **TIMESTAMPS** ####